Revit 2026 API

# ExternalGeometryId Methods

---

The ExternalGeometryId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Gets the hash code. (Overrides ObjectGetHashCode) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidExternalGeometryId | Checks whether a given string represents a valid ExternalGeometryId or not. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ExternalGeometryId Class

Autodesk.Revit.DB Namespace